{
"Projects":[
  {
    "title": "Liturgical.Display",
    "description": "Voice-controlled presentation system with FastAPI, WebSockets, and <200ms latency using Vosk STT for offline recognition.",
    "tags": ["Python", "FastAPI", "Tailwind", "WebSockets", "Vosk"],
    "links": {"code": "https://github.com/adover06/liturgy.display"}
  },
  {
    "title": "Spartan LMS",
    "description": "Lightweight Canvas-style LMS with Flask, SQLite, and SQLAlchemy featuring auth, grade management, and secure file handling.",
    "tags": ["Python", "Flask", "SQLite", "SQLAlchemy"],
    "links": {"code": ""}
  },
  {
    "title": "APRS Hiking Tracker",
    "description": "Self-tracking APRS hiking tool parsing TCP packets, running PostGIS geospatial queries, and mapping live routes via Mapbox.",
    "tags": ["Python", "PostgreSQL", "PostGIS", "Mapbox", "APRS"],
    "links": {"code": ""}
  },
  {
    "title": "Rust+ IoT Bridge",
    "description": "Event-driven IoT gateway listening to Rust+ companion API, forwarding rules from YAML to LAN devices with debouncing and retries.",
    "tags": ["Python", "FCM", "Docker", "IoT"],
    "links": {"code": ""}
  },
  {
    "title": "Real-Time ISS Doppler Tracking",
    "description": "Real-time Doppler calculator using SGP4 orbital propagation and radial velocity math to predict ISS frequency shifts.",
    "tags": ["Python", "SGP4", "Orbital Mechanics", "Doppler"],
    "links": {"code": ""}
  }
],
"Courses":[
    {
    "code": "CS 146",
    "title": "Data Structures and Algorithms",
    "description": "Implementations of advanced tree structures, priority queues, heaps, directed and undirected graphs. Advanced searching and sorting techniques (radix sort, heapsort, mergesort, and quicksort). Design and analysis of data structures and algorithms. Divide-and-conquer, greedy, and dynamic programming algorithm design techniques.",
    "url": "https://catalog.sjsu.edu/preview_course_nopop.php?catoid=17&coid=157882"
  },
  {
    "code": "CMPE 120",
    "title": "Computer Organization and Architecture",
    "description": "Introduction to computer organization and architecture, system buses, internal memory and external memory, input/output, central processing unit CPU, instruction sets, CPU structure and function, RISC, control unit.",
    "url": "https://catalog.sjsu.edu/preview_course_nopop.php?catoid=10&coid=41920"
  },
  {
    "code": "MATH 32",
    "title": "Calculus 3",
    "description": "Functions of more than one variable, partial derivatives, multiple integrals and vector calculus. Graphical, algebraic and numerical methods of solving problems.",
    "url": "https://catalog.sjsu.edu/preview_course_nopop.php?catoid=10&coid=41254"
  },
  {
    "code": "CMPE 131",
    "title": "Software Engineering I",
    "description": "Why software engineering? What is software engineering? Software development lifecycle activities: project planning and management requirements analysis, requirement specification. Software design, software testing, verification, validation, and documentation. Software quality assurance and review techniques, software maintenance, team-based projects.",
    "url": "https://catalog.sjsu.edu/preview_course_nopop.php?catoid=10&coid=41926"
  }]

}